frontend/controllers/CustomerApiController.php

SELECT * FROM `category_management` WHERE (`auto_id`='15') OR (`slug`='')
---
public function actionCategorylistyoutube(){
        $list = array();
        $postd=(Yii::$app ->request ->rawBody);
        $requestInput = json_decode($postd,true);
        $list['status'] = 'error';
        $list['message'] = 'Nill';
        if($requestInput['authkey']=="youtubeapi"){
             $bunch_ids=$requestInput['category_id'];
            if($bunch_ids!="1"){
            $bunch_ids1=$requestInput['slug'];
            if($bunch_ids!=''){
            $bunch_ids=$requestInput['category_id'];
            }
            else{
                $bunch_ids='';
            }
            if($bunch_ids1!=''){

                $bunch_ids1=$requestInput['slug'];

            }else{

                $bunch_ids1='';
            }
            $bunchinfo_cat=CategoryManagement::find()
             ->orWhere(['auto_id'=>$bunch_ids])
             ->orWhere(['slug'=>$bunch_ids1])
            ->asArray()
            ->one();

SELECT * FROM `video_management` WHERE (`auto_id`='14') AND (NOT (`youtube_id`='lzjM-gZm5mQ')) ORDER BY `video_id` DESC LIMIT 10
---
 public function actionCategorylistrelatedvideo(){
        $list = array();
        $postd=(Yii::$app ->request ->rawBody);


         //print_r($postd);die;
        $requestInput = json_decode($postd,true);
        $list['status'] = 'error';
        $list['message'] = 'Nill';
        if($requestInput['authkey']=="youtubeapi"){

            $bunch_ids=$requestInput['category_id'];
            $video_Idn=isset($requestInput['youtube_id']);
            //$bunch_ids1=$requestInput['slug'];
            if($bunch_ids!=''){
            if($video_Idn!=''){
            $bunch_ids=$requestInput['category_id'];
            $video_Idn=$requestInput['youtube_id'];
            $bunchinfo1222=VideoManagement::find()
            ->where(['auto_id'=>$bunch_ids])
            ->andWhere(['not',['youtube_id'=>$video_Idn]])
            ->orderBy(['video_id'=>SORT_DESC])
            ->asArray()
            ->limit(10)
            ->all();

SELECT * FROM `category_management` WHERE `auto_id`='14'
---
            if($bunchinfo122){
            $bunchinfor_index=ArrayHelper::index($bunchinfo122,'auto_id');
            foreach ($bunchinfo122 as $value) {
                   $bunchinfo_cat=CategoryManagement::find()
                   ->orWhere(['auto_id'=>$value['auto_id']])
                   ->one();

SELECT * FROM `category_management` WHERE `auto_id`='14'
---
            if($bunchinfo122){
            $bunchinfor_index=ArrayHelper::index($bunchinfo122,'auto_id');
            foreach ($bunchinfo122 as $value) {
                   $bunchinfo_cat=CategoryManagement::find()
                   ->orWhere(['auto_id'=>$value['auto_id']])
                   ->one();

SELECT * FROM `category_management` WHERE `active_status`='1'
---
 public function actionCategorylist(){
        $list = array();
        $postd=(Yii::$app ->request ->rawBody);
        $requestInput = json_decode($postd,true);
        $list['status'] = 'error';
        $list['message'] = 'Nill';
        if($requestInput['authkey']=="youtubeapi"){
           // $bunchinfo=VideoManagement::find()->where(['IN','auto_id',$bunch_ids])->asArray()->all();
            $bunchinfo_cat=CategoryManagement::find()
            ->where(['active_status'=>"1"])
            ->asArray()
            ->all();

SELECT * FROM `video_management` WHERE `active_status`='1' ORDER BY `auto_id`
SELECT * FROM `home_management`
SELECT * FROM `colorsystem`
SELECT * FROM `flash_screen`
---
 public function actionCategorylistfavhome(){
        $list = array();
        $postd=(Yii::$app ->request ->rawBody);
        $requestInput = json_decode($postd,true);
        $list['status'] = 'error';
        $list['message'] = 'Nill';

        if($requestInput['authkey']=="youtubeapi"){
         $bunchinfo_cat=VideoManagement::find()
         ->where(['active_status'=>"1"])
         ->orderBy(['auto_id'=>SORT_ASC])
         ->asArray()->all();
          $bunchinfo_home=HomeManagement::find()
         ->asArray()->one();
         $home=$bunchinfo_home['youtubelink'];
         $home1=$bunchinfo_home['youtube_id'];
         $base=Url::base(true);
         $result_array=array();
         $arrnew=array();
         $color=Colorsystem::find()
         ->asArray()->one();
         $flashscreen=FlashScreen::find()
         ->asArray()->one();

SELECT `category_name`, `slug`, `category_image`, `category_icon` FROM `category_management` WHERE (`auto_id`='14') AND (`home_status`='1')
---

        if($bunchinfo_cat){
          foreach ($bunchinfo_cat as $value) {
           $bunchinfo_catte=CategoryManagement::find()
           ->select(['category_name','slug','category_image','category_icon'])
           ->where(['auto_id'=>$value['auto_id']])
           ->andWhere(['home_status'=>'1'])
           ->asArray()
           ->one();