youtube/frontend/controllers/CustomerApiController.php

public function actionCategorylistyoutube(){
        $list = array();
        $postd=(Yii::$app ->request ->rawBody);
        $requestInput = json_decode($postd,true);
        $list['status'] = 'error';
        $list['message'] = 'Nill';
        if($requestInput['authkey']=="youtubeapi"){
             $bunch_ids=$requestInput['category_id'];
            if($bunch_ids!="1"){
            $bunch_ids1=$requestInput['slug'];
            if($bunch_ids!=''){
            $bunch_ids=$requestInput['category_id'];
            }
            else{
                $bunch_ids='';
            }
            if($bunch_ids1!=''){

                $bunch_ids1=$requestInput['slug'];

            }else{

                $bunch_ids1='';
            }
            $bunchinfo_cat=CategoryManagement::find()
             ->orWhere(['auto_id'=>$bunch_ids])
             ->orWhere(['slug'=>$bunch_ids1])
            ->asArray()
            ->one();
---
SELECT * FROM `category_management` WHERE (`auto_id`='11') OR (`slug`='')

            }else{
                $bunch_ids1='';
            }
            $bunchinfo_cat=CategoryManagement::find()
             ->orWhere(['auto_id'=>$bunch_ids])
             ->orWhere(['slug'=>$bunch_ids1])
            ->asArray()
            ->one();
---
SELECT * FROM `category_management` WHERE (`auto_id`='1') OR (`slug`='')

         if ($requestInput['page']=="all") {
            $page = $requestInput['page'];

            $bunchinfo=VideoManagement::find()
            ->orderBy(['video_id'=>SORT_DESC])
            ->asArray()
            ->limit(10)
            ->all();
---
SELECT * FROM `video_management` ORDER BY `video_id` DESC LIMIT 10

 public function actionCategorylistrelatedvideo(){
        $list = array();
        $postd=(Yii::$app ->request ->rawBody);

         //print_r($postd);die;
        $requestInput = json_decode($postd,true);
        $list['status'] = 'error';
        $list['message'] = 'Nill';
        if($requestInput['authkey']=="youtubeapi"){

            $bunchinfo_cat=CategoryManagement::find()
            ->one();
            $bunch_ids=$requestInput['category_id'];
            $video_Idn=isset($requestInput['youtube_id']);
            //$bunch_ids1=$requestInput['slug'];
            if($bunch_ids!=''){
            if($video_Idn!=''){
            $bunch_ids=$requestInput['category_id'];
            $video_Idn=$requestInput['youtube_id'];
            $bunchinfo1222=VideoManagement::find()
            ->where(['auto_id'=>$bunch_ids])
            ->andWhere(['not',['youtube_id'=>$video_Idn]])
            ->orderBy(['video_id'=>SORT_DESC])
            ->asArray()
            ->limit(10)
            ->all();
            if(!empty($bunchinfo1222)){
             $bunchinfo122=$bunchinfo1222;
            }else{
            $bunchinfo122=VideoManagement::find()
            ->orderBy(['video_id'=>SORT_DESC])
            ->asArray()
            ->limit(10)
            ->all();
---
SELECT * FROM `category_management`
SELECT * FROM `video_management` WHERE (`auto_id`='7') AND (NOT (`youtube_id`='')) ORDER BY `video_id` DESC LIMIT 10
SELECT * FROM `video_management` ORDER BY `video_id` DESC LIMIT 10

            if($bunchinfo122){
            $bunchinfor_index=ArrayHelper::index($bunchinfo122,'auto_id');
            foreach ($bunchinfo122 as $value) {
                   $bunchinfo_cat=CategoryManagement::find()
                   ->orWhere(['auto_id'=>$value['auto_id']])
                   ->one();
---
SELECT * FROM `category_management` WHERE `auto_id`='7'